package com.wys.geektime.designMode.oop;

/**
 * @author wangyasheng
 * @date 2021/1/21
 * @Describe: 理论一：当谈论面向对象的时候，我们到底在谈论什么
 */

/**
 * 1、什么是面向对象编程（OOP，全称Object Oriented Programming）？
 *
 * 面向对象编程是一种编程范式或编程风格。它以类或对象作为组织代码的基本单元，
 * 并将封装、抽象、继承、多态四个特性，作为代码设计和实现的基石。
 */

/**
 * 2、什么是面向对象编程语言（OOPL）？
 *
 * 面向对象编程语言是支持类或对象的语法机制，并有现成的语法机制，能方便的实现面向
 * 对象编程四大特性（封装、抽象、继承、多态）的编程语言。
 */

/**
 * 3、如何判断一个编程语言是否是面向对象编程语言？
 *
 * 如果按照严格的定义，需要有现成的语法支持类、对象、四大特性才能叫作面向
 * 对象编程语言。如果放宽要求的话，只要某种编程语言支持类、对象语法机制，
 * 那基本就可以说这种编程语言是面向对象编程语言了，不一定非要要求具有所有
 * 的四大特性。
 */

/**
 * 4、面向对象编程和面向对象编程语言之间有何关系？
 *
 * 面向对象编程一般使用面向对象编程语言来进行，但是不用面向对象编程语言，
 * 也可以进行面向对象编程。反过来讲，即便使用面向对象编程语言，写出来的
 * 代码也不一定是面向对象编程风格的，也有可能是面向过程编程风格的。
 */

/**
 * 5、什么是面向对象分析和面向对象设计？
 *
 * 简单点讲，面向对象分析就是要搞清楚做什么，面向对象设计就是要搞清楚怎么做。
 * 两个阶段最终的产出是类的设计，包括程序被拆解为那些类，每个类有哪些属性方法、
 * 类与类之间如何交互等等。
 */

class Chapter01_OOP {

}
